hazy1k/CW32-48L/6.官方资料-CW32L031核心板资料/测试例程/Libraries/inc/cw32l031.h
    struct {
      __IOM uint32_t START      : 1;            /*!< [0..0] desc START                                                         */
      __IOM uint32_t AUTOSTOP   : 1;            /*!< [1..1] desc AUTOSTOP                                                      */
      __IM  uint32_t            : 30;
    } START_f;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t CR2;                         /*!< (@ 0x00000010) desc CR2                                                   */
    
    struct {
      __IOM uint32_t CNT        : 8;            /*!< [7..0] desc CNT                                                           */
      __IOM uint32_t ACCEN      : 1;            /*!< [8..8] desc ACCEN                                                         */
      __IOM uint32_t ACCRST     : 1;            /*!< [9..9] desc ACCRST                                                        */
      __IM  uint32_t            : 22;
    } CR2_f;
  } ;
  
  union {
    __IOM uint32_t VTH;                         /*!< (@ 0x00000014) desc VTH                                                   */
    
    struct {
      __IOM uint32_t VTH        : 12;           /*!< [11..0] desc VTH                                                          */
      __IM  uint32_t            : 20;
    } VTH_f;
  } ;
  
  union {
    __IOM uint32_t VTL;                         /*!< (@ 0x00000018) desc VTL                                                   */
    
    struct {
      __IOM uint32_t VTL        : 12;           /*!< [11..0] desc VTL                                                          */
      __IM  uint32_t            : 20;
    } VTL_f;
  } ;
  
  union {
    __IOM uint32_t TRIGGER;                     /*!< (@ 0x0000001C) desc TRIGGER                                               */
    
    struct {
      __IOM uint32_t ATIM       : 1;            /*!< [0..0] desc ATIM                                                          */
      __IOM uint32_t GTIM1      : 1;            /*!< [1..1] desc GTIM1                                                         */
      __IOM uint32_t GTIM2      : 1;            /*!< [2..2] desc GTIM2                                                         */
      __IOM uint32_t            : 1;            /*!< [3..3] desc                                                               */
      __IOM uint32_t            : 1;            /*!< [4..4] desc                                                               */
      __IOM uint32_t BTIM1      : 1;            /*!< [5..5] desc BTIM1                                                         */
      __IOM uint32_t BTIM2      : 1;            /*!< [6..6] desc BTIM2                                                         */
      __IOM uint32_t BTIM3      : 1;            /*!< [7..7] desc BTIM3                                                         */
      __IOM uint32_t UART1      : 1;            /*!< [8..8] desc UART1                                                         */
      __IOM uint32_t UART2      : 1;            /*!< [9..9] desc UART2                                                         */
      __IOM uint32_t UART3      : 1;            /*!< [10..10] desc UART3                                                       */
      __IOM uint32_t SPI1       : 1;            /*!< [11..11] desc SPI1                                                        */
      __IOM uint32_t            : 1;            /*!< [12..12] desc                                                             */
      __IOM uint32_t I2C1       : 1;            /*!< [13..13] desc I2C1                                                        */
      __IOM uint32_t            : 1;            /*!< [14..14] desc                                                             */
      __IOM uint32_t DMA        : 1;            /*!< [15..15] desc DMA                                                         */
      __IOM uint32_t            : 1;            /*!< [16..16] desc                                                             */
      __IOM uint32_t            : 1;            /*!< [17..17] desc                                                             */
      __IOM uint32_t            : 1;            /*!< [18..18] desc                                                             */
      __IOM uint32_t GPIOA      : 1;            /*!< [19..19] desc GPIOA                                                       */
      __IOM uint32_t GPIOB      : 1;            /*!< [20..20] desc GPIOB                                                       */
      __IOM uint32_t GPIOC      : 1;            /*!< [21..21] desc GPIOC                                                       */
      __IOM uint32_t GPIOD      : 1;            /*!< [22..22] desc GPIOD                                                       */
      __IOM uint32_t GPIOE      : 1;            /*!< [23..23] desc GPIOE                                                       */
      __IOM uint32_t GPIOF      : 1;            /*!< [24..24] desc GPIOF                                                       */
      __IM  uint32_t            : 7;
    } TRIGGER_f;
  } ;
  
  union {
    __IM  uint32_t RESULT0;                     /*!< (@ 0x00000020) desc RESULT0                                               */
    
    struct {
      __IM  uint32_t RESULT     : 16;           /*!< [15..0] desc RESULT                                                       */
      __IM  uint32_t            : 16;
    } RESULT0_f;
  } ;
  
  union {
    __IM  uint32_t RESULT1;                     /*!< (@ 0x00000024) desc RESULT1                                               */
    
    struct {
      __IM  uint32_t RESULT     : 16;           /*!< [15..0] desc RESULT                                                       */
      __IM  uint32_t            : 16;
    } RESULT1_f;
  } ;
  
  union {
    __IM  uint32_t RESULT2;                     /*!< (@ 0x00000028) desc RESULT2                                               */
    
    struct {
      __IM  uint32_t RESULT     : 16;           /*!< [15..0] desc RESULT                                                       */
      __IM  uint32_t            : 16;
    } RESULT2_f;
  } ;
  
  union {
    __IM  uint32_t RESULT3;                     /*!< (@ 0x0000002C) desc RESULT3                                               */
    
