hazy1k/CW32-48L/6.官方资料-CW32L031核心板资料/测试例程/Libraries/inc/cw32l031.h
    struct {
      __IOM uint32_t UIF        : 1;            /*!< [0..0] desc UIF                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t C1AF       : 1;            /*!< [2..2] desc C1AF                                                          */
      __IOM uint32_t C2AF       : 1;            /*!< [3..3] desc C2AF                                                          */
      __IOM uint32_t C3AF       : 1;            /*!< [4..4] desc C3AF                                                          */
      __IOM uint32_t C1BF       : 1;            /*!< [5..5] desc C1BF                                                          */
      __IOM uint32_t C2BF       : 1;            /*!< [6..6] desc C2BF                                                          */
      __IOM uint32_t C3BF       : 1;            /*!< [7..7] desc C3BF                                                          */
      __IOM uint32_t C1AE       : 1;            /*!< [8..8] desc C1AE                                                          */
      __IOM uint32_t C2AE       : 1;            /*!< [9..9] desc C2AE                                                          */
      __IOM uint32_t C3AE       : 1;            /*!< [10..10] desc C3AE                                                        */
      __IOM uint32_t C1BE       : 1;            /*!< [11..11] desc C1BE                                                        */
      __IOM uint32_t C2BE       : 1;            /*!< [12..12] desc C2BE                                                        */
      __IOM uint32_t C3BE       : 1;            /*!< [13..13] desc C3BE                                                        */
      __IOM uint32_t BIF        : 1;            /*!< [14..14] desc BIF                                                         */
      __IOM uint32_t TIF        : 1;            /*!< [15..15] desc TIF                                                         */
      __IOM uint32_t OVF        : 1;            /*!< [16..16] desc OVF                                                         */
      __IOM uint32_t UNDF       : 1;            /*!< [17..17] desc UNDF                                                        */
      __IOM uint32_t C4AF       : 1;            /*!< [18..18] desc C4AF                                                        */
      __IM  uint32_t            : 13;
    } ICR_f;
  } ;
  
  union {
    __IOM uint32_t MSCR;                        /*!< (@ 0x00000018) desc MSCR                                                  */
    
    struct {
      __IOM uint32_t MMS        : 3;            /*!< [2..0] desc MMS                                                           */
      __IOM uint32_t CCDS       : 1;            /*!< [3..3] desc CCDS                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t TS         : 3;            /*!< [7..5] desc TS                                                            */
      __IOM uint32_t SMS        : 3;            /*!< [10..8] desc SMS                                                          */
      __IOM uint32_t IA1S       : 1;            /*!< [11..11] desc IA1S                                                        */
      __IOM uint32_t IB1S       : 1;            /*!< [12..12] desc IB1S                                                        */
      __IM  uint32_t            : 19;
    } MSCR_f;
  } ;
  
  union {
    __IOM uint32_t FLTR;                        /*!< (@ 0x0000001C) desc FLTR                                                  */
    
    struct {
      __IOM uint32_t OCM1AFLT1A : 3;            /*!< [2..0] desc OCM1AFLT1A                                                    */
      __IOM uint32_t CCP1A      : 1;            /*!< [3..3] desc CCP1A                                                         */
      __IOM uint32_t OCM1BFLT1B : 3;            /*!< [6..4] desc OCM1BFLT1B                                                    */
      __IOM uint32_t CCP1B      : 1;            /*!< [7..7] desc CCP1B                                                         */
      __IOM uint32_t OCM2AFLT2A : 3;            /*!< [10..8] desc OCM2AFLT2A                                                   */
      __IOM uint32_t CCP2A      : 1;            /*!< [11..11] desc CCP2A                                                       */
      __IOM uint32_t OCM2BFLT2B : 3;            /*!< [14..12] desc OCM2BFLT2B                                                  */
      __IOM uint32_t CCP2B      : 1;            /*!< [15..15] desc CCP2B                                                       */
      __IOM uint32_t OCM3AFLT3A : 3;            /*!< [18..16] desc OCM3AFLT3A                                                  */
      __IOM uint32_t CCP3A      : 1;            /*!< [19..19] desc CCP3A                                                       */
      __IOM uint32_t OCM3BFLT3B : 3;            /*!< [22..20] desc OCM3BFLT3B                                                  */
      __IOM uint32_t CCP3B      : 1;            /*!< [23..23] desc CCP3B                                                       */
      __IOM uint32_t FLTBK      : 3;            /*!< [26..24] desc FLTBK                                                       */
      __IOM uint32_t BKP        : 1;            /*!< [27..27] desc BKP                                                         */
      __IOM uint32_t FLTET      : 3;            /*!< [30..28] desc FLTET                                                       */
      __IOM uint32_t ETP        : 1;            /*!< [31..31] desc ETP                                                         */
    } FLTR_f;
  } ;
  
  union {
    __IOM uint32_t TRIG;                        /*!< (@ 0x00000020) desc TRIG                                                  */
    
    struct {
      __IOM uint32_t UEVE       : 1;            /*!< [0..0] desc UEVE                                                          */
      __IOM uint32_t CM1AE      : 1;            /*!< [1..1] desc CM1AE                                                         */
      __IOM uint32_t CM2AE      : 1;            /*!< [2..2] desc CM2AE                                                         */
      __IOM uint32_t CM3AE      : 1;            /*!< [3..3] desc CM3AE                                                         */
      __IOM uint32_t CM1BE      : 1;            /*!< [4..4] desc CM1BE                                                         */
      __IOM uint32_t CM2BE      : 1;            /*!< [5..5] desc CM2BE                                                         */
      __IOM uint32_t CM3BE      : 1;            /*!< [6..6] desc CM3BE                                                         */
      __IOM uint32_t ADTE       : 1;            /*!< [7..7] desc ADTE                                                          */
      __IM  uint32_t            : 24;
    } TRIG_f;
  } ;
  
  union {
    __IOM uint32_t CH1CR;                       /*!< (@ 0x00000024) desc CH1CR                                                 */
    
