hazy1k/CW32-48L/6.官方资料-CW32L031核心板资料/测试例程/Libraries/inc/cw32l031.h
    struct {
      __IOM uint32_t RCR        : 8;            /*!< [7..0] desc RCR                                                           */
      __IOM uint32_t OV         : 1;            /*!< [8..8] desc OV                                                            */
      __IOM uint32_t UD         : 1;            /*!< [9..9] desc UD                                                            */
      __IM  uint32_t            : 22;
    } RCR_f;
  } ;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IOM uint32_t CH1CCRA;                     /*!< (@ 0x0000003C) desc CH1CCRA                                               */
    
    struct {
      __IOM uint32_t CCR1A      : 16;           /*!< [15..0] desc CCR1A                                                        */
      __IM  uint32_t            : 16;
    } CH1CCRA_f;
  } ;
  
  union {
    __IOM uint32_t CH1CCRB;                     /*!< (@ 0x00000040) desc CH1CCRB                                               */
    
    struct {
      __IOM uint32_t CCR1B      : 16;           /*!< [15..0] desc CCR1B                                                        */
      __IM  uint32_t            : 16;
    } CH1CCRB_f;
  } ;
  
  union {
    __IOM uint32_t CH2CCRA;                     /*!< (@ 0x00000044) desc CH2CCRA                                               */
    
    struct {
      __IOM uint32_t CCR2A      : 16;           /*!< [15..0] desc CCR2A                                                        */
      __IM  uint32_t            : 16;
    } CH2CCRA_f;
  } ;
  
  union {
    __IOM uint32_t CH2CCRB;                     /*!< (@ 0x00000048) desc CH2CCRB                                               */
    
    struct {
      __IOM uint32_t CCR2B      : 16;           /*!< [15..0] desc CCR2B                                                        */
      __IM  uint32_t            : 16;
    } CH2CCRB_f;
  } ;
  
  union {
    __IOM uint32_t CH3CCRA;                     /*!< (@ 0x0000004C) desc CH3CCRA                                               */
    
    struct {
      __IOM uint32_t CCR3A      : 16;           /*!< [15..0] desc CCR3A                                                        */
      __IM  uint32_t            : 16;
    } CH3CCRA_f;
  } ;
  
  union {
    __IOM uint32_t CH3CCRB;                     /*!< (@ 0x00000050) desc CH3CCRB                                               */
    
    struct {
      __IOM uint32_t CCR3B      : 16;           /*!< [15..0] desc CCR3B                                                        */
      __IM  uint32_t            : 16;
    } CH3CCRB_f;
  } ;
  
  union {
    __IOM uint32_t CH4CCR;                      /*!< (@ 0x00000054) desc CH4CCR                                                */
    
    struct {
      __IOM uint32_t CCR4       : 16;           /*!< [15..0] desc CCR4                                                         */
      __IM  uint32_t            : 16;
    } CH4CCR_f;
  } ;
  
  union {
    __IOM uint32_t CH4CR;                       /*!< (@ 0x00000058) desc CH4CR                                                 */
    
    struct {
      __IOM uint32_t BUFE       : 1;            /*!< [0..0] desc BUFE                                                          */
      __IOM uint32_t CIE        : 1;            /*!< [1..1] desc CIE                                                           */
      __IOM uint32_t CDE        : 1;            /*!< [2..2] desc CDE                                                           */
      __IOM uint32_t CIS        : 2;            /*!< [4..3] desc CIS                                                           */
      __IOM uint32_t C4EN       : 1;            /*!< [5..5] desc C4EN                                                          */
      __IM  uint32_t            : 26;
    } CH4CR_f;
  } ;
} ATIM_TypeDef;                                    /*!< Size = 92 (0x5c)                                                          */



/* =========================================================================================================================== */
/* ================                                            AWT                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc AWT (AWT)
  */

typedef struct {                                /*!< (@ 0x40014C00) AWT Structure                                              */
  
  union {
    __IOM uint32_t CR;                          /*!< (@ 0x00000000) desc CR                                                    */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
      __IOM uint32_t MD         : 2;            /*!< [2..1] desc MD                                                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t PRS        : 4;            /*!< [7..4] desc PRS                                                           */
      __IOM uint32_t SRC        : 3;            /*!< [10..8] desc SRC                                                          */
      __IM  uint32_t            : 21;
    } CR_f;
  } ;
  
  union {
    __IOM uint32_t ARR;                         /*!< (@ 0x00000004) desc ARR                                                   */
    
    struct {
      __IOM uint32_t ARR        : 16;           /*!< [15..0] desc ARR                                                          */
      __IM  uint32_t            : 16;
    } ARR_f;
  } ;
  
  union {
    __IM  uint32_t CNT;                         /*!< (@ 0x00000008) desc CNT                                                   */
    
    struct {
      __IM  uint32_t CNT        : 16;           /*!< [15..0] desc CNT                                                          */
      __IM  uint32_t            : 16;
    } CNT_f;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t IER;                         /*!< (@ 0x00000010) desc IER                                                   */
    
