hazy1k/CW32-48L/6.官方资料-CW32L031核心板资料/测试例程/Libraries/inc/cw32l031.h
    struct {
      __IOM uint32_t OV         : 1;            /*!< [0..0] desc OV                                                            */
      __IOM uint32_t TRS        : 1;            /*!< [1..1] desc TRS                                                           */
      __IM  uint32_t            : 30;
    } DMA_f;
  } ;
  
  union {
    __IOM uint32_t PSC;                         /*!< (@ 0x00000024) desc PSC                                                   */
    
    struct {
      __IOM uint32_t PSC        : 16;           /*!< [15..0] desc PSC                                                          */
      __IM  uint32_t            : 16;
    } PSC_f;
  } ;
} BTIM_TypeDef;                                    /*!< Size = 40 (0x28)                                                          */



/* =========================================================================================================================== */
/* ================                                            CRC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc CRC (CRC)
  */

typedef struct {                                /*!< (@ 0x40023000) CRC Structure                                              */
  
  union {
    __IOM uint32_t CR;                          /*!< (@ 0x00000000) desc CR                                                    */
    
    struct {
      __IOM uint32_t MODE       : 4;            /*!< [3..0] desc MODE                                                          */
      __IM  uint32_t            : 28;
    } CR_f;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t DR;                          /*!< (@ 0x00000008) desc DR                                                    */
    
    struct {
      __IOM uint32_t DR         : 8;            /*!< [7..0] desc DR                                                            */
      __IM  uint32_t            : 24;
    } DR_f;
  } ;
  
  union {
    __IM  uint32_t RESULT;                      /*!< (@ 0x0000000C) desc RESULT                                                */
    
    struct {
      __IM  uint32_t RESULT     : 16;           /*!< [15..0] desc RESULT                                                       */
      __IM  uint32_t            : 16;
    } RESULT_f;
  } ;
} CRC_TypeDef;                                     /*!< Size = 20 (0x14)                                                          */



/* =========================================================================================================================== */
/* ================                                            DMA                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc DMA (DMA)
  */

typedef struct {                                /*!< (@ 0x40020000) DMA Structure                                              */
  
  union {
    __IM  uint32_t ISR;                         /*!< (@ 0x00000000) Interrupt status register                                  */
    
    struct {
      __IM  uint32_t TC1        : 1;            /*!< [0..0] desc TC1                                                           */
      __IM  uint32_t TE1        : 1;            /*!< [1..1] desc TE1                                                           */
      __IM  uint32_t            : 2;
      __IM  uint32_t TC2        : 1;            /*!< [4..4] desc TC2                                                           */
      __IM  uint32_t TE2        : 1;            /*!< [5..5] desc TE2                                                           */
      __IM  uint32_t            : 2;
      __IM  uint32_t TC3        : 1;            /*!< [8..8] desc TC3                                                           */
      __IM  uint32_t TE3        : 1;            /*!< [9..9] desc TE3                                                           */
      __IM  uint32_t            : 2;
      __IM  uint32_t TC4        : 1;            /*!< [12..12] desc TC4                                                         */
      __IM  uint32_t TE4        : 1;            /*!< [13..13] desc TE4                                                         */
    } ISR_f;
  } ;
  
  union {
    __IOM uint32_t ICR;                         /*!< (@ 0x00000004) Interrupt flag clear register                              */
    
    struct {
      __IOM uint32_t TC1        : 1;            /*!< [0..0] desc TC1                                                           */
      __IOM uint32_t TE1        : 1;            /*!< [1..1] desc TE1                                                           */
      __IM  uint32_t            : 2;
      __IOM uint32_t TC2        : 1;            /*!< [4..4] desc TC2                                                           */
      __IOM uint32_t TE2        : 1;            /*!< [5..5] desc TE2                                                           */
      __IM  uint32_t            : 2;
      __IOM uint32_t TC3        : 1;            /*!< [8..8] desc TC3                                                           */
      __IOM uint32_t TE3        : 1;            /*!< [9..9] desc TE3                                                           */
      __IM  uint32_t            : 2;
      __IOM uint32_t TC4        : 1;            /*!< [12..12] desc TC4                                                         */
      __IOM uint32_t TE4        : 1;            /*!< [13..13] desc TE4                                                         */
    } ICR_f;
  } ;
  __IM  uint32_t  RESERVED[6];
  
  union {
    __IOM uint32_t CSR1;                        /*!< (@ 0x00000020) Channel1 control and status register                       */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
      __IOM uint32_t TCIE       : 1;            /*!< [1..1] desc TCIE                                                          */
      __IOM uint32_t TEIE       : 1;            /*!< [2..2] desc TEIE                                                          */
      __IOM uint32_t TRANS      : 1;            /*!< [3..3] desc TRANS                                                         */
      __IOM uint32_t SRCINC     : 1;            /*!< [4..4] desc SRCINC                                                        */
      __IOM uint32_t DSTINC     : 1;            /*!< [5..5] desc DSTINC                                                        */
      __IOM uint32_t SIZE       : 2;            /*!< [7..6] desc SIZE                                                          */
      __IM  uint32_t STATUS     : 3;            /*!< [10..8] desc STATUS                                                       */
      __IM  uint32_t            : 21;
    } CSR1_f;
  } ;
  
  union {
    __IOM uint32_t CNT1;                        /*!< (@ 0x00000024) Channel1 counter register                                  */
    
