hazy1k/CW32-48L/6.官方资料-CW32L031核心板资料/测试例程/Libraries/inc/cw32l031.h
    struct {
      __IOM uint32_t DMA        : 1;            /*!< [0..0] desc DMA                                                           */
      __IOM uint32_t FLASH      : 1;            /*!< [1..1] desc FLASH                                                         */
      __IOM uint32_t CRC        : 1;            /*!< [2..2] desc CRC                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t GPIOA      : 1;            /*!< [4..4] desc GPIOA                                                         */
      __IOM uint32_t GPIOB      : 1;            /*!< [5..5] desc GPIOB                                                         */
      __IOM uint32_t GPIOC      : 1;            /*!< [6..6] desc GPIOC                                                         */
      __IM  uint32_t            : 2;
      __IOM uint32_t GPIOF      : 1;            /*!< [9..9] desc GPIOF                                                         */
      __IOM uint32_t            : 1;            /*!< [10..10] desc                                                             */
      __IOM uint32_t            : 1;            /*!< [11..11] desc                                                           */
      __IM  uint32_t            : 20;
    } AHBEN_f;
  } ;
  
  union {
    __IOM uint32_t APBEN2;                      /*!< (@ 0x00000034) desc APBEN2                                                */
    
    struct {
      __IM  uint32_t            : 2;
      __IOM uint32_t ADC        : 1;            /*!< [2..2] desc ADC                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t VC         : 1;            /*!< [4..4] desc VC                                                            */
      __IM  uint32_t            : 2;
      __IOM uint32_t ATIM       : 1;            /*!< [7..7] desc ATIM                                                          */
      __IOM uint32_t SPI1       : 1;            /*!< [8..8] desc SPI1                                                          */
      __IOM uint32_t UART1      : 1;            /*!< [9..9] desc UART1                                                         */
      __IOM uint32_t            : 1;            /*!< [10..10] desc                                                             */
      __IOM uint32_t            : 1;            /*!< [11..11] desc                                                             */
      __IOM uint32_t BTIM       : 1;            /*!< [12..12] desc BTIM                                                        */
      __IOM uint32_t AWT        : 1;            /*!< [13..13] desc AWT                                                         */
      __IM  uint32_t            : 18;
    } APBEN2_f;
  } ;
  
  union {
    __IOM uint32_t APBEN1;                      /*!< (@ 0x00000038) desc APBEN1                                                */
    
    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t GTIM1      : 1;            /*!< [1..1] desc GTIM1                                                         */
      __IOM uint32_t GTIM2      : 1;            /*!< [2..2] desc GTIM2                                                         */
      __IOM uint32_t RTC        : 1;            /*!< [3..3] desc RTC                                                           */
      __IOM uint32_t WWDT       : 1;            /*!< [4..4] desc WWDT                                                          */
      __IOM uint32_t IWDT       : 1;            /*!< [5..5] desc IWDT                                                          */
      __IOM uint32_t            : 1;            /*!< [6..6] desc                                                               */
      __IOM uint32_t UART2      : 1;            /*!< [7..7] desc UART2                                                         */
      __IOM uint32_t UART3      : 1;            /*!< [8..8] desc UART3                                                         */
      __IOM uint32_t            : 1;            /*!< [9..9] desc                                                               */
      __IOM uint32_t            : 1;            /*!< [10..10] desc                                                             */
      __IOM uint32_t I2C1       : 1;            /*!< [11..11] desc I2C1                                                        */
    } APBEN1_f;
  } ;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t AHBRST;                      /*!< (@ 0x00000040) desc AHBRST                                                */
    
    struct {
      __IOM uint32_t DMA        : 1;            /*!< [0..0] desc DMA                                                           */
      __IOM uint32_t FLASH      : 1;            /*!< [1..1] desc FLASH                                                         */
      __IOM uint32_t CRC        : 1;            /*!< [2..2] desc CRC                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t GPIOA      : 1;            /*!< [4..4] desc GPIOA                                                         */
      __IOM uint32_t GPIOB      : 1;            /*!< [5..5] desc GPIOB                                                         */
      __IOM uint32_t GPIOC      : 1;            /*!< [6..6] desc GPIOC                                                         */
      __IM  uint32_t            : 2;
      __IOM uint32_t GPIOF      : 1;            /*!< [9..9] desc GPIOF                                                         */
      __IOM uint32_t            : 1;            /*!< [10..10] desc                                                             */
      __IOM uint32_t            : 1;            /*!< [11..11] desc                                                           */
      __IM  uint32_t            : 20;
    } AHBRST_f;
  } ;
  
  union {
    __IOM uint32_t APBRST2;                     /*!< (@ 0x00000044) desc APBRST2                                               */
    
