hazy1k/CW32-48L/6.官方资料-CW32L031核心板资料/测试例程/Libraries/inc/cw32l031.h
    struct {
      __IOM uint32_t TXE        : 1;            /*!< [0..0] TxBuf empty                                                        */
      __IOM uint32_t TC         : 1;            /*!< [1..1] Transmit complete                                                  */
      __IOM uint32_t RC         : 1;            /*!< [2..2] Receive complete                                                   */
      __IOM uint32_t FE         : 1;            /*!< [3..3] Frame error                                                        */
      __IOM uint32_t PE         : 1;            /*!< [4..4] Parity error                                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t CTS        : 1;            /*!< [6..6] CTS change                                                         */
      __IM  uint32_t            : 2;
      __IOM uint32_t TIMOV      : 1;            /*!< [9..9] desc TIMOV                                                         */
      __IOM uint32_t BAUD       : 1;            /*!< [10..10] desc BAUD                                                        */
      __IOM uint32_t RXBRK      : 1;            /*!< [11..11] desc RXBRK                                                       */
    } IER_f;
  } ;
  
  union {
    __IOM uint32_t BRRI;                        /*!< (@ 0x0000000C) desc BRRI                                                  */
    
    struct {
      __IOM uint32_t BRRI       : 16;           /*!< [15..0] desc BRRI                                                         */
      __IM  uint32_t            : 16;
    } BRRI_f;
  } ;
  
  union {
    __IOM uint32_t BRRF;                        /*!< (@ 0x00000010) desc BRRF                                                  */
    
    struct {
      __IOM uint32_t BRRF       : 4;            /*!< [3..0] desc BRRF                                                          */
      __IM  uint32_t            : 28;
    } BRRF_f;
  } ;
  
  union {
    __IOM uint32_t TIMARR;                      /*!< (@ 0x00000014) desc TIMARR                                                */
    
    struct {
      __IOM uint32_t TIMARR     : 24;           /*!< [23..0] desc TIMARR                                                       */
    } TIMARR_f;
  } ;
  
  union {
    __IOM uint32_t TIMCNT;                      /*!< (@ 0x00000018) desc TIMCNT                                                */
    
    struct {
      __IOM uint32_t TIMCNT     : 24;           /*!< [23..0] desc TIMCNT                                                       */
    } TIMCNT_f;
  } ;
  
  union {
    __IM  uint32_t ISR;                         /*!< (@ 0x0000001C) desc ISR                                                   */
    
    struct {
      __IM  uint32_t TXE        : 1;            /*!< [0..0] TxBuf empty                                                        */
      __IM  uint32_t TC         : 1;            /*!< [1..1] Transmit complete                                                  */
      __IM  uint32_t RC         : 1;            /*!< [2..2] Receive complete                                                   */
      __IM  uint32_t FE         : 1;            /*!< [3..3] Frame error                                                        */
      __IM  uint32_t PE         : 1;            /*!< [4..4] Parity error                                                       */
      __IM  uint32_t MATCH      : 1;            /*!< [5..5] Slave addr match                                                   */
      __IM  uint32_t CTS        : 1;            /*!< [6..6] CTS change                                                         */
      __IM  uint32_t CTSLV      : 1;            /*!< [7..7] CTS PIN level                                                      */
      __IM  uint32_t TXBUSY     : 1;            /*!< [8..8] desc TXBUSY                                                        */
      __IM  uint32_t TIMOV      : 1;            /*!< [9..9] desc TIMOV                                                         */
      __IM  uint32_t BAUD       : 1;            /*!< [10..10] desc BAUD                                                        */
      __IM  uint32_t RXBRK      : 1;            /*!< [11..11] desc RXBRK                                                       */
    } ISR_f;
  } ;
  
  union {
    __IOM uint32_t ICR;                         /*!< (@ 0x00000020) desc ICR                                                   */
    
    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t TC         : 1;            /*!< [1..1] Transmit complete                                                  */
      __IOM uint32_t RC         : 1;            /*!< [2..2] Receive complete                                                   */
      __IOM uint32_t FE         : 1;            /*!< [3..3] Frame error                                                        */
      __IOM uint32_t PE         : 1;            /*!< [4..4] Parity error                                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t CTS        : 1;            /*!< [6..6] CTS change                                                         */
      __IM  uint32_t            : 2;
      __IOM uint32_t TIMOV      : 1;            /*!< [9..9] desc TIMOV                                                         */
      __IOM uint32_t BAUD       : 1;            /*!< [10..10] desc BAUD                                                        */
      __IOM uint32_t RXBRK      : 1;            /*!< [11..11] desc RXBRK                                                       */
    } ICR_f;
  } ;
  
  union {
    __IM  uint32_t RDR;                         /*!< (@ 0x00000024) desc RDR                                                   */
    
    struct {
      __IM  uint32_t RDR        : 9;            /*!< [8..0] desc RDR                                                           */
      __IM  uint32_t            : 23;
    } RDR_f;
  } ;
  
  union {
    __OM  uint32_t TDR;                         /*!< (@ 0x00000028) desc TDR                                                   */
    
