hazy1k/CW32-48L/6.官方资料-CW32L031核心板资料/测试例程/Libraries/inc/cw32l031.h
/** @} */ /* End of group Device_Peripheral_declaration */


/* =========================================  End of section using anonymous unions  ========================================= */
#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif


/* =========================================================================================================================== */
/* ================                                Pos/Mask Peripheral Section                                ================ */
/* =========================================================================================================================== */


/** @addtogroup PosMask_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                            ADC                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR0  ========================================================== */
#define ADC_CR0_BIAS_Pos                  (14UL)                    /*!< BIAS (Bit 14)                                         */
#define ADC_CR0_BIAS_Msk                  (0xc000UL)                /*!< BIAS (Bitfield-Mask: 0x03)                            */
#define ADC_CR0_BUF_Pos                   (13UL)                    /*!< BUF (Bit 13)                                          */
#define ADC_CR0_BUF_Msk                   (0x2000UL)                /*!< BUF (Bitfield-Mask: 0x01)                             */
#define ADC_CR0_SAM_Pos                   (11UL)                    /*!< SAM (Bit 11)                                          */
#define ADC_CR0_SAM_Msk                   (0x1800UL)                /*!< SAM (Bitfield-Mask: 0x03)                             */
#define ADC_CR0_CLK_Pos                   (8UL)                     /*!< CLK (Bit 8)                                           */
#define ADC_CR0_CLK_Msk                   (0x700UL)                 /*!< CLK (Bitfield-Mask: 0x07)                             */
#define ADC_CR0_REF_Pos                   (6UL)                     /*!< REF (Bit 6)                                           */
#define ADC_CR0_REF_Msk                   (0xc0UL)                  /*!< REF (Bitfield-Mask: 0x03)                             */
#define ADC_CR0_TSEN_Pos                  (5UL)                     /*!< TSEN (Bit 5)                                          */
#define ADC_CR0_TSEN_Msk                  (0x20UL)                  /*!< TSEN (Bitfield-Mask: 0x01)                            */
#define ADC_CR0_MODE_Pos                  (1UL)                     /*!< MODE (Bit 1)                                          */
#define ADC_CR0_MODE_Msk                  (0xeUL)                   /*!< MODE (Bitfield-Mask: 0x07)                            */
#define ADC_CR0_EN_Pos                    (0UL)                     /*!< EN (Bit 0)                                            */
#define ADC_CR0_EN_Msk                    (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* ==========================================================  CR1  ========================================================== */
#define ADC_CR1_DMASOCEN_Pos              (15UL)                    /*!< DMASOCEN (Bit 15)                                     */
#define ADC_CR1_DMASOCEN_Msk              (0x8000UL)                /*!< DMASOCEN (Bitfield-Mask: 0x01)                        */
#define ADC_CR1_DMASOFEN_Pos              (14UL)                    /*!< DMASOFEN (Bit 14)                                     */
#define ADC_CR1_DMASOFEN_Msk              (0x4000UL)                /*!< DMASOFEN (Bitfield-Mask: 0x01)                        */
#define ADC_CR1_WDTALL_Pos                (13UL)                    /*!< WDTALL (Bit 13)                                       */
#define ADC_CR1_WDTALL_Msk                (0x2000UL)                /*!< WDTALL (Bitfield-Mask: 0x01)                          */
#define ADC_CR1_WDTCH_Pos                 (8UL)                     /*!< WDTCH (Bit 8)                                         */
#define ADC_CR1_WDTCH_Msk                 (0xf00UL)                 /*!< WDTCH (Bitfield-Mask: 0x0f)                           */
#define ADC_CR1_ALIGN_Pos                 (6UL)                     /*!< ALIGN (Bit 6)                                         */
#define ADC_CR1_ALIGN_Msk                 (0x40UL)                  /*!< ALIGN (Bitfield-Mask: 0x01)                           */
#define ADC_CR1_DISCARD_Pos               (5UL)                     /*!< DISCARD (Bit 5)                                       */
#define ADC_CR1_DISCARD_Msk               (0x20UL)                  /*!< DISCARD (Bitfield-Mask: 0x01)                         */
#define ADC_CR1_CHMUX_Pos                 (0UL)                     /*!< CHMUX (Bit 0)                                         */
#define ADC_CR1_CHMUX_Msk                 (0xfUL)                   /*!< CHMUX (Bitfield-Mask: 0x0f)                           */
/* ==========================================================  CR2  ========================================================== */
#define ADC_CR2_ACCRST_Pos                (9UL)                     /*!< ACCRST (Bit 9)                                        */
#define ADC_CR2_ACCRST_Msk                (0x200UL)                 /*!< ACCRST (Bitfield-Mask: 0x01)                          */
#define ADC_CR2_ACCEN_Pos                 (8UL)                     /*!< ACCEN (Bit 8)                                         */
#define ADC_CR2_ACCEN_Msk                 (0x100UL)                 /*!< ACCEN (Bitfield-Mask: 0x01)                           */
#define ADC_CR2_CNT_Pos                   (0UL)                     /*!< CNT (Bit 0)                                           */
#define ADC_CR2_CNT_Msk                   (0xffUL)                  /*!< CNT (Bitfield-Mask: 0xff)                             */
/* =========================================================  SQR0  ========================================================== */
#define ADC_SQR0_ENS_Pos                  (16UL)                    /*!< ENS (Bit 16)                                          */
#define ADC_SQR0_ENS_Msk                  (0x70000UL)               /*!< ENS (Bitfield-Mask: 0x07)                             */
#define ADC_SQR0_SQR3_Pos                 (12UL)                    /*!< SQR3 (Bit 12)                                         */
#define ADC_SQR0_SQR3_Msk                 (0xf000UL)                /*!< SQR3 (Bitfield-Mask: 0x0f)                            */
#define ADC_SQR0_SQR2_Pos                 (8UL)                     /*!< SQR2 (Bit 8)                                          */
#define ADC_SQR0_SQR2_Msk                 (0xf00UL)                 /*!< SQR2 (Bitfield-Mask: 0x0f)                            */
#define ADC_SQR0_SQR1_Pos                 (4UL)                     /*!< SQR1 (Bit 4)                                          */
#define ADC_SQR0_SQR1_Msk                 (0xf0UL)                  /*!< SQR1 (Bitfield-Mask: 0x0f)                            */
#define ADC_SQR0_SQR0_Pos                 (0UL)                     /*!< SQR0 (Bit 0)                                          */
#define ADC_SQR0_SQR0_Msk                 (0xfUL)                   /*!< SQR0 (Bitfield-Mask: 0x0f)                            */
/* =========================================================  SQR1  ========================================================== */
#define ADC_SQR1_SQR7_Pos                 (12UL)                    /*!< SQR7 (Bit 12)                                         */
#define ADC_SQR1_SQR7_Msk                 (0xf000UL)                /*!< SQR7 (Bitfield-Mask: 0x0f)                            */
#define ADC_SQR1_SQR6_Pos                 (8UL)                     /*!< SQR6 (Bit 8)                                          */
#define ADC_SQR1_SQR6_Msk                 (0xf00UL)                 /*!< SQR6 (Bitfield-Mask: 0x0f)                            */
#define ADC_SQR1_SQR5_Pos                 (4UL)                     /*!< SQR5 (Bit 4)                                          */
#define ADC_SQR1_SQR5_Msk                 (0xf0UL)                  /*!< SQR5 (Bitfield-Mask: 0x0f)                            */
#define ADC_SQR1_SQR4_Pos                 (0UL)                     /*!< SQR4 (Bit 0)                                          */
#define ADC_SQR1_SQR4_Msk                 (0xfUL)                   /*!< SQR4 (Bitfield-Mask: 0x0f)                            */
/* =========================================================  SQR2  ========================================================== */
#define ADC_SQR2_REPEAT_Pos               (16UL)                    /*!< REPEAT (Bit 16)                                       */
#define ADC_SQR2_REPEAT_Msk               (0x10000UL)               /*!< REPEAT (Bitfield-Mask: 0x01)                          */
#define ADC_SQR2_CH15_Pos                 (15UL)                    /*!< CH15 (Bit 15)                                         */
#define ADC_SQR2_CH15_Msk                 (0x8000UL)                /*!< CH15 (Bitfield-Mask: 0x01)                            */
#define ADC_SQR2_CH14_Pos                 (14UL)                    /*!< CH14 (Bit 14)                                         */
#define ADC_SQR2_CH14_Msk                 (0x4000UL)                /*!< CH14 (Bitfield-Mask: 0x01)                            */
#define ADC_SQR2_CH13_Pos                 (13UL)                    /*!< CH13 (Bit 13)                                         */
#define ADC_SQR2_CH13_Msk                 (0x2000UL)                /*!< CH13 (Bitfield-Mask: 0x01)                            */
#define ADC_SQR2_CH12_Pos                 (12UL)                    /*!< CH12 (Bit 12)                                         */
#define ADC_SQR2_CH12_Msk                 (0x1000UL)                /*!< CH12 (Bitfield-Mask: 0x01)                            */
#define ADC_SQR2_CH11_Pos                 (11UL)                    /*!< CH11 (Bit 11)                                         */
#define ADC_SQR2_CH11_Msk                 (0x800UL)                 /*!< CH11 (Bitfield-Mask: 0x01)                            */
#define ADC_SQR2_CH10_Pos                 (10UL)                    /*!< CH10 (Bit 10)                                         */
#define ADC_SQR2_CH10_Msk                 (0x400UL)                 /*!< CH10 (Bitfield-Mask: 0x01)                            */
#define ADC_SQR2_CH9_Pos                  (9UL)                     /*!< CH9 (Bit 9)                                           */
#define ADC_SQR2_CH9_Msk                  (0x200UL)                 /*!< CH9 (Bitfield-Mask: 0x01)                             */
#define ADC_SQR2_CH8_Pos                  (8UL)                     /*!< CH8 (Bit 8)                                           */
#define ADC_SQR2_CH8_Msk                  (0x100UL)                 /*!< CH8 (Bitfield-Mask: 0x01)                             */
#define ADC_SQR2_CH7_Pos                  (7UL)                     /*!< CH7 (Bit 7)                                           */
#define ADC_SQR2_CH7_Msk                  (0x80UL)                  /*!< CH7 (Bitfield-Mask: 0x01)                             */
#define ADC_SQR2_CH6_Pos                  (6UL)                     /*!< CH6 (Bit 6)                                           */
#define ADC_SQR2_CH6_Msk                  (0x40UL)                  /*!< CH6 (Bitfield-Mask: 0x01)                             */
#define ADC_SQR2_CH5_Pos                  (5UL)                     /*!< CH5 (Bit 5)                                           */
#define ADC_SQR2_CH5_Msk                  (0x20UL)                  /*!< CH5 (Bitfield-Mask: 0x01)                             */
#define ADC_SQR2_CH4_Pos                  (4UL)                     /*!< CH4 (Bit 4)                                           */
#define ADC_SQR2_CH4_Msk                  (0x10UL)                  /*!< CH4 (Bitfield-Mask: 0x01)                             */
#define ADC_SQR2_CH3_Pos                  (3UL)                     /*!< CH3 (Bit 3)                                           */
#define ADC_SQR2_CH3_Msk                  (0x8UL)                   /*!< CH3 (Bitfield-Mask: 0x01)                             */
#define ADC_SQR2_CH2_Pos                  (2UL)                     /*!< CH2 (Bit 2)                                           */
#define ADC_SQR2_CH2_Msk                  (0x4UL)                   /*!< CH2 (Bitfield-Mask: 0x01)                             */
#define ADC_SQR2_CH1_Pos                  (1UL)                     /*!< CH1 (Bit 1)                                           */
#define ADC_SQR2_CH1_Msk                  (0x2UL)                   /*!< CH1 (Bitfield-Mask: 0x01)                             */
#define ADC_SQR2_CH0_Pos                  (0UL)                     /*!< CH0 (Bit 0)                                           */
#define ADC_SQR2_CH0_Msk                  (0x1UL)                   /*!< CH0 (Bitfield-Mask: 0x01)                             */
/* ==========================================================  VTH  ========================================================== */
#define ADC_VTH_VTH_Pos                   (0UL)                     /*!< VTH (Bit 0)                                           */
#define ADC_VTH_VTH_Msk                   (0xfffUL)                 /*!< VTH (Bitfield-Mask: 0xfff)                            */
/* ==========================================================  VTL  ========================================================== */
#define ADC_VTL_VTL_Pos                   (0UL)                     /*!< VTL (Bit 0)                                           */
#define ADC_VTL_VTL_Msk                   (0xfffUL)                 /*!< VTL (Bitfield-Mask: 0xfff)                            */
/* ========================================================  TRIGGER  ======================================================== */
#define ADC_TRIGGER_GPIOF_Pos             (24UL)                    /*!< GPIOF (Bit 24)                                        */
#define ADC_TRIGGER_GPIOF_Msk             (0x1000000UL)             /*!< GPIOF (Bitfield-Mask: 0x01)                           */
#define ADC_TRIGGER_GPIOC_Pos             (21UL)                    /*!< GPIOC (Bit 21)                                        */
#define ADC_TRIGGER_GPIOC_Msk             (0x200000UL)              /*!< GPIOC (Bitfield-Mask: 0x01)                           */
#define ADC_TRIGGER_GPIOB_Pos             (20UL)                    /*!< GPIOB (Bit 20)                                        */
#define ADC_TRIGGER_GPIOB_Msk             (0x100000UL)              /*!< GPIOB (Bitfield-Mask: 0x01)                           */
#define ADC_TRIGGER_GPIOA_Pos             (19UL)                    /*!< GPIOA (Bit 19)                                        */
#define ADC_TRIGGER_GPIOA_Msk             (0x80000UL)               /*!< GPIOA (Bitfield-Mask: 0x01)                           */
#define ADC_TRIGGER_DMA_Pos               (15UL)                    /*!< DMA (Bit 15)                                          */
#define ADC_TRIGGER_DMA_Msk               (0x8000UL)                /*!< DMA (Bitfield-Mask: 0x01)                             */
#define ADC_TRIGGER_I2C1_Pos              (13UL)                    /*!< I2C1 (Bit 13)                                         */
#define ADC_TRIGGER_I2C1_Msk              (0x2000UL)                /*!< I2C1 (Bitfield-Mask: 0x01)                            */
#define ADC_TRIGGER_SPI1_Pos              (11UL)                    /*!< SPI1 (Bit 11)                                         */
#define ADC_TRIGGER_SPI1_Msk              (0x800UL)                 /*!< SPI1 (Bitfield-Mask: 0x01)                            */
#define ADC_TRIGGER_UART3_Pos             (10UL)                    /*!< UART3 (Bit 10)                                        */
#define ADC_TRIGGER_UART3_Msk             (0x400UL)                 /*!< UART3 (Bitfield-Mask: 0x01)                           */
#define ADC_TRIGGER_UART2_Pos             (9UL)                     /*!< UART2 (Bit 9)                                         */
#define ADC_TRIGGER_UART2_Msk             (0x200UL)                 /*!< UART2 (Bitfield-Mask: 0x01)                           */
#define ADC_TRIGGER_UART1_Pos             (8UL)                     /*!< UART1 (Bit 8)                                         */
#define ADC_TRIGGER_UART1_Msk             (0x100UL)                 /*!< UART1 (Bitfield-Mask: 0x01)                           */
#define ADC_TRIGGER_BTIM3_Pos             (7UL)                     /*!< BTIM3 (Bit 7)                                         */
#define ADC_TRIGGER_BTIM3_Msk             (0x80UL)                  /*!< BTIM3 (Bitfield-Mask: 0x01)                           */
#define ADC_TRIGGER_BTIM2_Pos             (6UL)                     /*!< BTIM2 (Bit 6)                                         */
#define ADC_TRIGGER_BTIM2_Msk             (0x40UL)                  /*!< BTIM2 (Bitfield-Mask: 0x01)                           */
#define ADC_TRIGGER_BTIM1_Pos             (5UL)                     /*!< BTIM1 (Bit 5)                                         */
#define ADC_TRIGGER_BTIM1_Msk             (0x20UL)                  /*!< BTIM1 (Bitfield-Mask: 0x01)                           */
#define ADC_TRIGGER_GTIM2_Pos             (2UL)                     /*!< GTIM2 (Bit 2)                                         */
#define ADC_TRIGGER_GTIM2_Msk             (0x4UL)                   /*!< GTIM2 (Bitfield-Mask: 0x01)                           */
#define ADC_TRIGGER_GTIM1_Pos             (1UL)                     /*!< GTIM1 (Bit 1)                                         */
#define ADC_TRIGGER_GTIM1_Msk             (0x2UL)                   /*!< GTIM1 (Bitfield-Mask: 0x01)                           */
#define ADC_TRIGGER_ATIM_Pos              (0UL)                     /*!< ATIM (Bit 0)                                          */
#define ADC_TRIGGER_ATIM_Msk              (0x1UL)                   /*!< ATIM (Bitfield-Mask: 0x01)                            */
/* =========================================================  START  ========================================================= */
#define ADC_START_AUTOSTOP_Pos            (1UL)                     /*!< AUTOSTOP (Bit 1)                                      */
#define ADC_START_AUTOSTOP_Msk            (0x2UL)                   /*!< AUTOSTOP (Bitfield-Mask: 0x01)                        */
#define ADC_START_START_Pos               (0UL)                     /*!< START (Bit 0)                                         */
#define ADC_START_START_Msk               (0x1UL)                   /*!< START (Bitfield-Mask: 0x01)                           */
/* ==========================================================  IER  ========================================================== */
#define ADC_IER_OVW_Pos                   (6UL)                     /*!< OVW (Bit 6)                                           */
#define ADC_IER_OVW_Msk                   (0x40UL)                  /*!< OVW (Bitfield-Mask: 0x01)                             */
#define ADC_IER_WDTR_Pos                  (5UL)                     /*!< WDTR (Bit 5)                                          */
#define ADC_IER_WDTR_Msk                  (0x20UL)                  /*!< WDTR (Bitfield-Mask: 0x01)                            */
#define ADC_IER_WDTH_Pos                  (4UL)                     /*!< WDTH (Bit 4)                                          */
#define ADC_IER_WDTH_Msk                  (0x10UL)                  /*!< WDTH (Bitfield-Mask: 0x01)                            */
#define ADC_IER_WDTL_Pos                  (3UL)                     /*!< WDTL (Bit 3)                                          */
#define ADC_IER_WDTL_Msk                  (0x8UL)                   /*!< WDTL (Bitfield-Mask: 0x01)                            */
#define ADC_IER_EOA_Pos                   (2UL)                     /*!< EOA (Bit 2)                                           */
#define ADC_IER_EOA_Msk                   (0x4UL)                   /*!< EOA (Bitfield-Mask: 0x01)                             */
#define ADC_IER_EOS_Pos                   (1UL)                     /*!< EOS (Bit 1)                                           */
#define ADC_IER_EOS_Msk                   (0x2UL)                   /*!< EOS (Bitfield-Mask: 0x01)                             */
#define ADC_IER_EOC_Pos                   (0UL)                     /*!< EOC (Bit 0)                                           */
#define ADC_IER_EOC_Msk                   (0x1UL)                   /*!< EOC (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ISR  ========================================================== */
#define ADC_ISR_READY_Pos                 (7UL)                     /*!< READY (Bit 7)                                         */
#define ADC_ISR_READY_Msk                 (0x80UL)                  /*!< READY (Bitfield-Mask: 0x01)                           */
#define ADC_ISR_OVW_Pos                   (6UL)                     /*!< OVW (Bit 6)                                           */
#define ADC_ISR_OVW_Msk                   (0x40UL)                  /*!< OVW (Bitfield-Mask: 0x01)                             */
#define ADC_ISR_WDTR_Pos                  (5UL)                     /*!< WDTR (Bit 5)                                          */
#define ADC_ISR_WDTR_Msk                  (0x20UL)                  /*!< WDTR (Bitfield-Mask: 0x01)                            */
#define ADC_ISR_WDTH_Pos                  (4UL)                     /*!< WDTH (Bit 4)                                          */
#define ADC_ISR_WDTH_Msk                  (0x10UL)                  /*!< WDTH (Bitfield-Mask: 0x01)                            */
#define ADC_ISR_WDTL_Pos                  (3UL)                     /*!< WDTL (Bit 3)                                          */
#define ADC_ISR_WDTL_Msk                  (0x8UL)                   /*!< WDTL (Bitfield-Mask: 0x01)                            */
#define ADC_ISR_EOA_Pos                   (2UL)                     /*!< EOA (Bit 2)                                           */
#define ADC_ISR_EOA_Msk                   (0x4UL)                   /*!< EOA (Bitfield-Mask: 0x01)                             */
#define ADC_ISR_EOS_Pos                   (1UL)                     /*!< EOS (Bit 1)                                           */
#define ADC_ISR_EOS_Msk                   (0x2UL)                   /*!< EOS (Bitfield-Mask: 0x01)                             */
#define ADC_ISR_EOC_Pos                   (0UL)                     /*!< EOC (Bit 0)                                           */
#define ADC_ISR_EOC_Msk                   (0x1UL)                   /*!< EOC (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ICR  ========================================================== */
#define ADC_ICR_OVW_Pos                   (6UL)                     /*!< OVW (Bit 6)                                           */
#define ADC_ICR_OVW_Msk                   (0x40UL)                  /*!< OVW (Bitfield-Mask: 0x01)                             */
