hazy1k/CW32-48L/6.官方资料-CW32L031核心板资料/测试例程/Libraries/inc/cw32l031.h
#define SYSCTRL_APBEN2_ATIM_Msk           (0x80UL)                  /*!< ATIM (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBEN2_VC_Pos             (4UL)                     /*!< VC (Bit 4)                                            */
#define SYSCTRL_APBEN2_VC_Msk             (0x10UL)                  /*!< VC (Bitfield-Mask: 0x01)                              */
#define SYSCTRL_APBEN2_ADC_Pos            (2UL)                     /*!< ADC (Bit 2)                                           */
#define SYSCTRL_APBEN2_ADC_Msk            (0x4UL)                   /*!< ADC (Bitfield-Mask: 0x01)                             */
/* ========================================================  AHBRST  ========================================================= */
#define SYSCTRL_AHBRST_GPIOF_Pos          (9UL)                     /*!< GPIOF (Bit 9)                                         */
#define SYSCTRL_AHBRST_GPIOF_Msk          (0x200UL)                 /*!< GPIOF (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBRST_GPIOC_Pos          (6UL)                     /*!< GPIOC (Bit 6)                                         */
#define SYSCTRL_AHBRST_GPIOC_Msk          (0x40UL)                  /*!< GPIOC (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBRST_GPIOB_Pos          (5UL)                     /*!< GPIOB (Bit 5)                                         */
#define SYSCTRL_AHBRST_GPIOB_Msk          (0x20UL)                  /*!< GPIOB (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBRST_GPIOA_Pos          (4UL)                     /*!< GPIOA (Bit 4)                                         */
#define SYSCTRL_AHBRST_GPIOA_Msk          (0x10UL)                  /*!< GPIOA (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBRST_CRC_Pos            (2UL)                     /*!< CRC (Bit 2)                                           */
#define SYSCTRL_AHBRST_CRC_Msk            (0x4UL)                   /*!< CRC (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_AHBRST_FLASH_Pos          (1UL)                     /*!< FLASH (Bit 1)                                         */
#define SYSCTRL_AHBRST_FLASH_Msk          (0x2UL)                   /*!< FLASH (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBRST_DMA_Pos            (0UL)                     /*!< DMA (Bit 0)                                           */
#define SYSCTRL_AHBRST_DMA_Msk            (0x1UL)                   /*!< DMA (Bitfield-Mask: 0x01)                             */
/* ========================================================  APBRST1  ======================================================== */
#define SYSCTRL_APBRST1_I2C1_Pos          (11UL)                    /*!< I2C1 (Bit 11)                                         */
#define SYSCTRL_APBRST1_I2C1_Msk          (0x800UL)                 /*!< I2C1 (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBRST1_UART3_Pos         (8UL)                     /*!< UART3 (Bit 8)                                         */
#define SYSCTRL_APBRST1_UART3_Msk         (0x100UL)                 /*!< UART3 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBRST1_UART2_Pos         (7UL)                     /*!< UART2 (Bit 7)                                         */
#define SYSCTRL_APBRST1_UART2_Msk         (0x80UL)                  /*!< UART2 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBRST1_IWDT_Pos          (5UL)                     /*!< IWDT (Bit 5)                                          */
#define SYSCTRL_APBRST1_IWDT_Msk          (0x20UL)                  /*!< IWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBRST1_WWDT_Pos          (4UL)                     /*!< WWDT (Bit 4)                                          */
#define SYSCTRL_APBRST1_WWDT_Msk          (0x10UL)                  /*!< WWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBRST1_RTC_Pos           (3UL)                     /*!< RTC (Bit 3)                                           */
#define SYSCTRL_APBRST1_RTC_Msk           (0x8UL)                   /*!< RTC (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_APBRST1_GTIM2_Pos         (2UL)                     /*!< GTIM2 (Bit 2)                                         */
#define SYSCTRL_APBRST1_GTIM2_Msk         (0x4UL)                   /*!< GTIM2 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBRST1_GTIM1_Pos         (1UL)                     /*!< GTIM1 (Bit 1)                                         */
#define SYSCTRL_APBRST1_GTIM1_Msk         (0x2UL)                   /*!< GTIM1 (Bitfield-Mask: 0x01)                           */
/* ========================================================  APBRST2  ======================================================== */
#define SYSCTRL_APBRST2_AWT_Pos           (13UL)                    /*!< AWT (Bit 13)                                          */
#define SYSCTRL_APBRST2_AWT_Msk           (0x2000UL)                /*!< AWT (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_APBRST2_BTIM_Pos          (12UL)                    /*!< BTIM (Bit 12)                                         */
#define SYSCTRL_APBRST2_BTIM_Msk          (0x1000UL)                /*!< BTIM (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBRST2_UART1_Pos         (9UL)                     /*!< UART1 (Bit 9)                                         */
#define SYSCTRL_APBRST2_UART1_Msk         (0x200UL)                 /*!< UART1 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBRST2_SPI1_Pos          (8UL)                     /*!< SPI1 (Bit 8)                                          */
#define SYSCTRL_APBRST2_SPI1_Msk          (0x100UL)                 /*!< SPI1 (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBRST2_ATIM_Pos          (7UL)                     /*!< ATIM (Bit 7)                                          */
#define SYSCTRL_APBRST2_ATIM_Msk          (0x80UL)                  /*!< ATIM (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBRST2_VC_Pos            (4UL)                     /*!< VC (Bit 4)                                            */
#define SYSCTRL_APBRST2_VC_Msk            (0x10UL)                  /*!< VC (Bitfield-Mask: 0x01)                              */
#define SYSCTRL_APBRST2_ADC_Pos           (2UL)                     /*!< ADC (Bit 2)                                           */
#define SYSCTRL_APBRST2_ADC_Msk           (0x4UL)                   /*!< ADC (Bitfield-Mask: 0x01)                             */
/* =======================================================  RESETFLAG  ======================================================= */
#define SYSCTRL_RESETFLAG_SYSREQ_Pos      (9UL)                     /*!< SYSREQ (Bit 9)                                        */
#define SYSCTRL_RESETFLAG_SYSREQ_Msk      (0x200UL)                 /*!< SYSREQ (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_RESETFLAG_LOCKUP_Pos      (8UL)                     /*!< LOCKUP (Bit 8)                                        */
#define SYSCTRL_RESETFLAG_LOCKUP_Msk      (0x100UL)                 /*!< LOCKUP (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_RESETFLAG_SOFTPOR_Pos     (7UL)                     /*!< SOFTPOR (Bit 7)                                       */
#define SYSCTRL_RESETFLAG_SOFTPOR_Msk     (0x80UL)                  /*!< SOFTPOR (Bitfield-Mask: 0x01)                         */
#define SYSCTRL_RESETFLAG_RSTB_Pos        (6UL)                     /*!< RSTB (Bit 6)                                          */
#define SYSCTRL_RESETFLAG_RSTB_Msk        (0x40UL)                  /*!< RSTB (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_RESETFLAG_WWDT_Pos        (5UL)                     /*!< WWDT (Bit 5)                                          */
#define SYSCTRL_RESETFLAG_WWDT_Msk        (0x20UL)                  /*!< WWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_RESETFLAG_IWDT_Pos        (4UL)                     /*!< IWDT (Bit 4)                                          */
#define SYSCTRL_RESETFLAG_IWDT_Msk        (0x10UL)                  /*!< IWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_RESETFLAG_LVD_Pos         (3UL)                     /*!< LVD (Bit 3)                                           */
#define SYSCTRL_RESETFLAG_LVD_Msk         (0x8UL)                   /*!< LVD (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_RESETFLAG_VCORE_Pos       (1UL)                     /*!< VCORE (Bit 1)                                         */
#define SYSCTRL_RESETFLAG_VCORE_Msk       (0x2UL)                   /*!< VCORE (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_RESETFLAG_POR_Pos         (0UL)                     /*!< POR (Bit 0)                                           */
#define SYSCTRL_RESETFLAG_POR_Msk         (0x1UL)                   /*!< POR (Bitfield-Mask: 0x01)                             */
/* ========================================================  DEBUGEN  ======================================================== */
#define SYSCTRL_DEBUG_WWDT_Pos            (10UL)                    /*!< WWDT (Bit 10)                                         */
#define SYSCTRL_DEBUG_WWDT_Msk            (0x400UL)                 /*!< WWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_DEBUG_IWDT_Pos            (9UL)                     /*!< IWDT (Bit 9)                                          */
#define SYSCTRL_DEBUG_IWDT_Msk            (0x200UL)                 /*!< IWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_DEBUG_RTC_Pos             (8UL)                     /*!< RTC (Bit 8)                                           */
#define SYSCTRL_DEBUG_RTC_Msk             (0x100UL)                 /*!< RTC (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_DEBUG_AWT_Pos             (6UL)                     /*!< AWT (Bit 6)                                           */
#define SYSCTRL_DEBUG_AWT_Msk             (0x40UL)                  /*!< AWT (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_DEBUG_BTIM123_Pos         (5UL)                     /*!< BTIM123 (Bit 5)                                       */
#define SYSCTRL_DEBUG_BTIM123_Msk         (0x20UL)                  /*!< BTIM123 (Bitfield-Mask: 0x01)                         */
#define SYSCTRL_DEBUG_GTIM2_Pos           (2UL)                     /*!< GTIM2 (Bit 2)                                         */
#define SYSCTRL_DEBUG_GTIM2_Msk           (0x4UL)                   /*!< GTIM2 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_DEBUG_GTIM1_Pos           (1UL)                     /*!< GTIM1 (Bit 1)                                         */
#define SYSCTRL_DEBUG_GTIM1_Msk           (0x2UL)                   /*!< GTIM1 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_DEBUG_ATIM_Pos            (0UL)                     /*!< ATIM (Bit 0)                                          */
#define SYSCTRL_DEBUG_ATIM_Msk            (0x1UL)                   /*!< ATIM (Bitfield-Mask: 0x01)                            */
/* =======================================================  GTIM1CAP  ======================================================== */
#define SYSCTRL_GTIM1CAP_CH4_Pos          (12UL)                    /*!< CH4 (Bit 12)                                          */
#define SYSCTRL_GTIM1CAP_CH4_Msk          (0x7000UL)                /*!< CH4 (Bitfield-Mask: 0x07)                             */
#define SYSCTRL_GTIM1CAP_CH3_Pos          (8UL)                     /*!< CH3 (Bit 8)                                           */
#define SYSCTRL_GTIM1CAP_CH3_Msk          (0x700UL)                 /*!< CH3 (Bitfield-Mask: 0x07)                             */
#define SYSCTRL_GTIM1CAP_CH2_Pos          (4UL)                     /*!< CH2 (Bit 4)                                           */
#define SYSCTRL_GTIM1CAP_CH2_Msk          (0x70UL)                  /*!< CH2 (Bitfield-Mask: 0x07)                             */
#define SYSCTRL_GTIM1CAP_CH1_Pos          (0UL)                     /*!< CH1 (Bit 0)                                           */
#define SYSCTRL_GTIM1CAP_CH1_Msk          (0x7UL)                   /*!< CH1 (Bitfield-Mask: 0x07)                             */
/* =======================================================  GTIM2CAP  ======================================================== */
#define SYSCTRL_GTIM2CAP_CH4_Pos          (12UL)                    /*!< CH4 (Bit 12)                                          */
#define SYSCTRL_GTIM2CAP_CH4_Msk          (0x7000UL)                /*!< CH4 (Bitfield-Mask: 0x07)                             */
#define SYSCTRL_GTIM2CAP_CH3_Pos          (8UL)                     /*!< CH3 (Bit 8)                                           */
#define SYSCTRL_GTIM2CAP_CH3_Msk          (0x700UL)                 /*!< CH3 (Bitfield-Mask: 0x07)                             */
#define SYSCTRL_GTIM2CAP_CH2_Pos          (4UL)                     /*!< CH2 (Bit 4)                                           */
#define SYSCTRL_GTIM2CAP_CH2_Msk          (0x70UL)                  /*!< CH2 (Bitfield-Mask: 0x07)                             */
#define SYSCTRL_GTIM2CAP_CH1_Pos          (0UL)                     /*!< CH1 (Bit 0)                                           */
#define SYSCTRL_GTIM2CAP_CH1_Msk          (0x7UL)                   /*!< CH1 (Bitfield-Mask: 0x07)                             */
/* ========================================================  ATIMETR  ======================================================== */
#define SYSCTRL_ATIMETR_ATIMETR_Pos       (0UL)                     /*!< ATIMETR (Bit 0)                                       */
#define SYSCTRL_ATIMETR_ATIMETR_Msk       (0x7UL)                   /*!< ATIMETR (Bitfield-Mask: 0x07)                         */
/* ========================================================  GTIMETR  ======================================================== */
#define SYSCTRL_GTIMETR_GTIM2ETR_Pos      (4UL)                     /*!< GTIM2ETR (Bit 4)                                      */
#define SYSCTRL_GTIMETR_GTIM2ETR_Msk      (0x70UL)                  /*!< GTIM2ETR (Bitfield-Mask: 0x07)                        */
#define SYSCTRL_GTIMETR_GTIM1ETR_Pos      (0UL)                     /*!< GTIM1ETR (Bit 0)                                      */
#define SYSCTRL_GTIMETR_GTIM1ETR_Msk      (0x7UL)                   /*!< GTIM1ETR (Bitfield-Mask: 0x07)                        */
/* =======================================================  ATIMGATE  ======================================================== */
#define SYSCTRL_ATIMGATE_ATIMGATE_Pos     (0UL)                     /*!< ATIMGATE (Bit 0)                                      */
#define SYSCTRL_ATIMGATE_ATIMGATE_Msk     (0x7UL)                   /*!< ATIMGATE (Bitfield-Mask: 0x07)                        */
/* ========================================================  TIMITR  ========================================================= */
#define SYSCTRL_TIMITR_BTIM3ITR_Pos       (21UL)                    /*!< BTIM3ITR (Bit 21)                                     */
#define SYSCTRL_TIMITR_BTIM3ITR_Msk       (0xe00000UL)              /*!< BTIM3ITR (Bitfield-Mask: 0x07)                        */
#define SYSCTRL_TIMITR_BTIM2ITR_Pos       (18UL)                    /*!< BTIM2ITR (Bit 18)                                     */
#define SYSCTRL_TIMITR_BTIM2ITR_Msk       (0x1c0000UL)              /*!< BTIM2ITR (Bitfield-Mask: 0x07)                        */
#define SYSCTRL_TIMITR_BTIM1ITR_Pos       (15UL)                    /*!< BTIM1ITR (Bit 15)                                     */
#define SYSCTRL_TIMITR_BTIM1ITR_Msk       (0x38000UL)               /*!< BTIM1ITR (Bitfield-Mask: 0x07)                        */
#define SYSCTRL_TIMITR_GTIM2ITR_Pos       (6UL)                     /*!< GTIM2ITR (Bit 6)                                      */
#define SYSCTRL_TIMITR_GTIM2ITR_Msk       (0x1c0UL)                 /*!< GTIM2ITR (Bitfield-Mask: 0x07)                        */
#define SYSCTRL_TIMITR_GTIM1ITR_Pos       (3UL)                     /*!< GTIM1ITR (Bit 3)                                      */
#define SYSCTRL_TIMITR_GTIM1ITR_Msk       (0x38UL)                  /*!< GTIM1ITR (Bitfield-Mask: 0x07)                        */
#define SYSCTRL_TIMITR_ATIMITR_Pos        (0UL)                     /*!< ATIMITR (Bit 0)                                       */
#define SYSCTRL_TIMITR_ATIMITR_Msk        (0x7UL)                   /*!< ATIMITR (Bitfield-Mask: 0x07)                         */
/* ==========================================================  MCO  ========================================================== */
#define SYSCTRL_MCO_DIV_Pos               (4UL)                     /*!< DIV (Bit 4)                                           */
#define SYSCTRL_MCO_DIV_Msk               (0x70UL)                  /*!< DIV (Bitfield-Mask: 0x07)                             */
#define SYSCTRL_MCO_SOURCE_Pos            (0UL)                     /*!< SOURCE (Bit 0)                                        */
#define SYSCTRL_MCO_SOURCE_Msk            (0xfUL)                   /*!< SOURCE (Bitfield-Mask: 0x0f)                          */


/* =========================================================================================================================== */
/* ================                                           UART                                            ================ */
/* =========================================================================================================================== */

